app/controllers/autors_controller.rb

SELECT "autors".* FROM "autors"
---
  def index
    @autors = Autor.all

INSERT INTO "autors" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "[\"ROCHA, Guilherme\"]"], ["created_at", "2020-05-16 19:40:11.335579"], ["updated_at", "2020-05-16 19:40:11.335579"]]
---
  def create
    @autor = Autor.new

    @autor.nome = @autor.formata_nomes(autor_params[:nome_contador], autor_params[:nome])

    if @autor.save